using System.ComponentModel.DataAnnotations;

namespace VigenereCipherWeb.Models
{
    public class Cipher
    {
        public readonly string[] vigenerSquare =
        {
             "абвгдеёжзийклмнопрстуфхцчшщъыьэюя",
             "бвгдеёжзийклмнопрстуфхцчшщъыьэюяа",
             "вгдеёжзийклмнопрстуфхцчшщъыьэюяаб",
             "гдеёжзийклмнопрстуфхцчшщъыьэюяабв",
             "деёжзийклмнопрстуфхцчшщъыьэюяабвг",
             "еёжзийклмнопрстуфхцчшщъыьэюяабвгд",
             "ёжзийклмнопрстуфхцчшщъыьэюяабвгде",
             "жзийклмнопрстуфхцчшщъыьэюяабвгдеё",
             "зийклмнопрстуфхцчшщъыьэюяабвгдеёж",
             "ийклмнопрстуфхцчшщъыьэюяабвгдеёжз",
             "йклмнопрстуфхцчшщъыьэюяабвгдеёжзи",
             "клмнопрстуфхцчшщъыьэюяабвгдеёжзий",
             "лмнопрстуфхцчшщъыьэюяабвгдеёжзийк",
             "мнопрстуфхцчшщъыьэюяабвгдеёжзийкл",
             "нопрстуфхцчшщъыьэюяабвгдеёжзийклм",
             "опрстуфхцчшщъыьэюяабвгдеёжзийклмн",
             "прстуфхцчшщъыьэюяабвгдеёжзийклмно",
             "рстуфхцчшщъыьэюяабвгдеёжзийклмноп",
             "стуфхцчшщъыьэюяабвгдеёжзийклмнопр",
             "туфхцчшщъыьэюяабвгдеёжзийклмнопрс",
             "уфхцчшщъыьэюяабвгдеёжзийклмнопрст",
             "фхцчшщъыьэюяабвгдеёжзийклмнопрсту",
             "хцчшщъыьэюяабвгдеёжзийклмнопрстуф",
             "цчшщъыьэюяабвгдеёжзийклмнопрстуфх",
             "чшщъыьэюяабвгдеёжзийклмнопрстуфхц",
             "шщъыьэюяабвгдеёжзийклмнопрстуфхцч",
             "щъыьэюяабвгдеёжзийклмнопрстуфхцчш",
             "ъыьэюяабвгдеёжзийклмнопрстуфхцчшщ",
             "ыьэюяабвгдеёжзийклмнопрстуфхцчшщъ",
             "ьэюяабвгдеёжзийклмнопрстуфхцчшщъы",
             "эюяабвгдеёжзийклмнопрстуфхцчшщъыь",
             "юяабвгдеёжзийклмнопрстуфхцчшщъыьэ",
             "яабвгдеёжзийклмнопрстуфхцчшщъыьэю"
        };

        public const string alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";

        [Required(ErrorMessage = "Введите ваш текст")]
        public string Text { get; set; }
        [Required(ErrorMessage = "Введите ваш ключ")]
        public string Key { get; set; }
        public bool IsEncrypt { get; set; }
        public string Result { get; set; }
    }
}
